validation/conventional/squareCylinder/LES/STD/2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         	pimpleFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             1;

deltaT              0.00005;

writeControl        adjustableRunTime;

writeInterval       0.01;

purgeWrite          0;

writeFormat         	ascii;

writePrecision      8;

writeCompression    off;

timeFormat          general;

timePrecision       8;

runTimeModifiable    yes;

adjustTimeStep      no;

maxCo               0.9;

maxDeltaT           	0.01;

libs 
(
);

functions
{
	#includeFunc	fieldAverage(U, p, prime2Mean=yes)
	#includeFunc	one_component_sampling
	#includeFunc	two_component_sampling
}

// ************************************************************************* //
